# -*- coding: utf-8 -*-
# Список продуктов для бургера и файла making_a_burger
# Бургер классический
def buns_for_burger():
    start = print('Для начала возьмем булочки')
    final = print('Накрываем втрой булочкой наш бургер. Бургер готоа, вкусно и точка. Приятного аппетита!')

def beef_patty():
    print('Кладем сочную говяжью котлету')

def cheese():
    print('На котлету укладываем слайс сыра')

def tomato():
    print('Поверх огурчиков выкладываем слайс помидора, тоже 3 кружочка')

def cucumber():
    print('Выкладываем на лист салата кружочки огурчиков по канону 3 штуки')

def red_onion():
    print('Далее укладываем кольца лука')

def salad_leaves():
    print('На булочку кладем лист салата')

def bbq_sauce():
    print('Промазываем обе булочки используя соус барбекю')
