# -*- coding: utf-8 -*-
# Привет это kaluginpeter, сегодня разберем тему конфликта в Git
# Переодически в системе клнтроля версий(GIT) может возникать проблема коммитов(именуемая конфликтами.
# Это возникает из-за не своевременного пула проекта и последующих попытках его пуша на сервер
# при работе с одним файлом.
# Git просто не может запушить твой коммит так как уже имеет соответствующий на сервере, и кидает тебе реджект.
# Чтобы избежать данной ситуации следует сделать аплоад проекта(pull), Гит предложит сделать автоматическое слияние
# коммитов, можно принять его и проблема будет исчерпана, но это не всегда хорошо.
# Лучшим способом будет вручную просмотреть изменения и только после этого принимать изменения.
# Таким образом подводя итоги слияние веток в Гите(merge) - крайне полезная фича
# "имеющая место быть" в голове программиста.
# Конечно это лишь малая часть темы слияния веток, но расписывать её здесь полностью будет не совсем правильно,
# так как лучше всего обратитьчя к открытым ресурсам интернета, да и я сам описываю здесь свои мысли
# и темы которые узнаю в разработке. Успехов в познании цифрового мира. С Вами как всегда был kaluginpeter