# -*- coding: utf-8 -*-
# O my God WASSUP xexe. Как говориться "Here we go again". Это по-прежнему kaluginpeter
# и на этот раз с математической задачкой(если так можно выразится)
# Нужно расставить знаки операций "плюс", "минус", "умножение" и скобки
# между числами "1 2 3 4 5" так, что бы получилось число "25"(Вы можете подумать, что это задачи на уровне Гарварда,
# и я скажу Вам: "Так и есть" Пс - а может и нет)).
#
# Условие: Использовать нужно только указанные знаки операций, но не обязательно все перечесленные.
# Порядок чисел нужно сохранить.
result = 1 * (2 + 3) * 4 + 5
print(result)

#Homework is done. Мне кажется, что если бы Энштейн увидел данное решение, то наверняка решил бы теорию единого поля


